src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КурсКоммерческийПокупка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсКоммерческийПродажа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КурсыВалют/Forms/Запись/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( ЗначениеЗаполнено ( Параметры.Ключ ) ) Тогда
		// код ...
	Иначе
		заполнитьПоСрезуПоследних ();
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура заполнитьПоСрезуПоследних ()
	
	Запись.Валюта = Справочники.Валюты.Доллар; 
	с = "
	|выбрать
	|	Курс как Курс, КурсКоммерческийПокупка как КурсКоммерческийПокупка,
	|	КурсКоммерческийПродажа как КурсКоммерческийПродажа
	|из
	|	РегистрСведений.КурсыВалют.СрезПоследних ( , Валюта = значение ( Справочник.Валюты.Доллар ) ) 
	|";
	запрос = Новый Запрос ( с );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока ( выборка.Следующий () ) Цикл
		Запись.Курс = выборка.Курс;
		Запись.КурсКоммерческийПокупка = выборка.КурсКоммерческийПокупка;
		Запись.КурсКоммерческийПродажа = выборка.КурсКоммерческийПродажа;
	КонецЦикла; 
	
КонецПроцедуры
